In [11]:
library(tidyverse)
library(tidyr)

# Baby Names

In [3]:
baby2014 <- read_csv("../Datasets/2014-baby-names-illinois.csv")
baby2014$Year <- 2014
baby2014 %>%
    head()

-- Column specification ------------------------------------------------------------------------------------------------
cols(
  rank = col_double(),
  name = col_character(),
  frequency = col_double(),
  sex = col_character()
)

  rank name      frequency sex  Year
1 1    Noah      837       Male 2014
2 2    Alexander 747       Male 2014
3 3    William   687       Male 2014
4 4    Michael   680       Male 2014
5 5    Liam      670       Male 2014
6 6    Jacob     654       Male 2014

In [4]:
baby2015 <- read_csv("../Datasets/2015-baby-names-illinois.csv")
baby2015$Year <- 2015
baby2015 %>%
    head()

-- Column specification ------------------------------------------------------------------------------------------------
cols(
  rank = col_double(),
  name = col_character(),
  frequency = col_double(),
  sex = col_character()
)

  rank name      frequency sex  Year
1 1    Noah      863       Male 2015
2 2    Liam      709       Male 2015
3 3    Alexander 703       Male 2015
4 4    Jacob     650       Male 2015
5 5    William   618       Male 2015
6 6    Michael   617       Male 2015

## Error:

One type of experimental unit stored in multiple tables

In [6]:
babies <- rbind(baby2014, baby2015)
babies %>%
    head()

  rank name      frequency sex  Year
1 1    Noah      837       Male 2014
2 2    Alexander 747       Male 2014
3 3    William   687       Male 2014
4 4    Michael   680       Male 2014
5 5    Liam      670       Male 2014
6 6    Jacob     654       Male 2014

# Pew Data

In [10]:
pew <- read_tsv("../Datasets/pew.txt")
pew %>%
    head()

-- Column specification ------------------------------------------------------------------------------------------------
cols(
  religion = col_character(),
  `<$10k` = col_double(),
  `$10-20k` = col_double(),
  `$20-30k` = col_double(),
  `$30-40k` = col_double(),
  `$40-50k` = col_double(),
  `$50-75k` = col_double(),
  `$75-100k` = col_double(),
  `$100-150k` = col_double(),
  `>150k` = col_double(),
  `Don't know/refused` = col_double()
)

  religion           <$10k $10-20k $20-30k $30-40k $40-50k $50-75k $75-100k
1 Agnostic            27    34       60     81      76      137    122
2 Atheist             12    27       37     52      35       70     73
3 Buddhist            27    21       30     34      33       58     62
4 Catholic           418   617      732    670     638     1116    949
5 Don’t know/refused  15    14       15     11      10       35     21
6 Evangelical Prot   575   869     1064    982     881     1486    949
  $100-150k >150k Don't know/refused
1 109        84     96
2  59        74     76
3  39        53     54
4 792       633   1489
5  17        18    116
6 723       414   1529

## Error:
Column headers are values, not variable names, because are intervarl of money ears, therefore, it is useless to use it as variables

In [14]:
pew_tidy <- pew %>%
                pivot_longer(-religion, names_to = "income", values_to = "freq")
pew_tidy %>%
    head()

  religion income  freq
1 Agnostic <$10k    27
2 Agnostic $10-20k  34
3 Agnostic $20-30k  60
4 Agnostic $30-40k  81
5 Agnostic $40-50k  76
6 Agnostic $50-75k 137

# Weather

In [35]:
weather <- read_tsv("../Datasets/weather.txt")
weather %>%
    head()

-- Column specification ------------------------------------------------------------------------------------------------
cols(
  .default = col_double(),
  id = col_character(),
  element = col_character(),
  d9 = col_logical(),
  d12 = col_logical(),
  d18 = col_logical(),
  d19 = col_logical(),
  d20 = col_logical(),
  d21 = col_logical(),
  d22 = col_logical(),
  d24 = col_logical()
)
i Use `spec()` for the full column specifications.

  id          year month element d1 d2  d3  d4 d5  d6 ... d22 d23 d24 d25 d26
1 MX000017004 2010 1     TMAX    NA  NA  NA NA  NA NA ... NA   NA NA  NA  NA
2 MX000017004 2010 1     TMIN    NA  NA  NA NA  NA NA ... NA   NA NA  NA  NA
3 MX000017004 2010 2     TMAX    NA 273 241 NA  NA NA ... NA  299 NA  NA  NA
4 MX000017004 2010 2     TMIN    NA 144 144 NA  NA NA ... NA  107 NA  NA  NA
5 MX000017004 2010 3     TMAX    NA  NA  NA NA 321 NA ... NA   NA NA  NA  NA
6 MX000017004 2010 3     TMIN    NA  NA  NA NA 142 NA ... NA   NA NA  NA  NA
  d27 d28 d29 d30 d31
1 NA  NA  NA  278 NA
2 NA  NA  NA  145 NA
3 NA  NA  NA   NA NA
4 NA  NA  NA   NA NA
5 NA  NA  NA   NA NA
6 NA  NA  NA   NA NA

## Error:
Variables are stored in both rows and columns, this can be easy to see in the column element because contains variables that are TMAX and TMIN, should be columns. Additionally, id, year and month are variable columns by itself

In [48]:

# melting the csv to get the column element that contains TMAX and TMIN and each one its temperature, and another
# columns that contains that day, the drop the row that have empty values


weather_tidy <- weather %>%
                    pivot_longer(
                        cols = starts_with("d"),
                        names_to = "Day",
                        values_to = "Temperature"
                    )

weather_tidy <- weather_tidy %>% 
                    drop_na()

weather_tidy$Day <- stringr::str_replace_all(weather_tidy$Day, "d", "")

weather_copy <- weather_tidy %>% data.frame()

weather_tidy %>%    
    head()

  id          year month element Day Temperature
1 MX000017004 2010 1     TMAX    30  278
2 MX000017004 2010 1     TMIN    30  145
3 MX000017004 2010 2     TMAX    2   273
4 MX000017004 2010 2     TMAX    3   241
5 MX000017004 2010 2     TMAX    11  297
6 MX000017004 2010 2     TMAX    23  299

In [49]:
# Getting the tidy table applying a pivot table, where the index are id, year, month and day
# the columns are TMAX and TMIN, and the values the temperature

weather_tidy2 <- weather_copy %>%
                    pivot_wider(
                    names_from = "element",
                    values_from = "Temperature"
                    )

weather_tidy2 %>%
    head()

  id          year month Day TMAX TMIN
1 MX000017004 2010 1     30  278  145
2 MX000017004 2010 2     2   273  144
3 MX000017004 2010 2     3   241  144
4 MX000017004 2010 2     11  297  134
5 MX000017004 2010 2     23  299  107
6 MX000017004 2010 3     5   321  142

# Bilboard Dataset

In [17]:
billboard <- read_csv("../Datasets/billboard.csv")
billboard %>%
        head()

-- Column specification ------------------------------------------------------------------------------------------------
cols(
  .default = col_double(),
  artist.inverted = col_character(),
  track = col_character(),
  time = col_time(format = ""),
  genre = col_character(),
  date.entered = col_date(format = ""),
  date.peaked = col_date(format = ""),
  x66th.week = col_logical(),
  x67th.week = col_logical(),
  x68th.week = col_logical(),
  x69th.week = col_logical(),
  x70th.week = col_logical(),
  x71st.week = col_logical(),
  x72nd.week = col_logical(),
  x73rd.week = col_logical(),
  x74th.week = col_logical(),
  x75th.week = col_logical(),
  x76th.week = col_logical()
)
i Use `spec()` for the full column specifications.

  year artist.inverted     track                                 time     genre
1 2000 Destiny's Child     Independent Women Part I              03:38:00 Rock
2 2000 Santana             Maria, Maria                          04:18:00 Rock
3 2000 Savage Garden       I Knew I Loved You                    04:07:00 Rock
4 2000 Madonna             Music                                 03:45:00 Rock
5 2000 Aguilera, Christina Come On Over Baby (All I Want Is You) 03:38:00 Rock
6 2000 Janet               Doesn't Really Matter                 04:17:00 Rock
  date.entered date.peaked x1st.week x2nd.week x3rd.week ... x67th.week
1 2000-09-23   2000-11-18  78        63        49        ... NA
2 2000-02-12   2000-04-08  15         8         6        ... NA
3 1999-10-23   2000-01-29  71        48        43        ... NA
4 2000-08-12   2000-09-16  41        23        18        ... NA
5 2000-08-05   2000-10-14  57        47        45        ... NA
6 2000-06-17   2000-08-26  59        52        43        ... NA
  x68th.week x69th.week x70th.week x71st.week x72nd.week x73rd.week x74th.week
1 NA         NA         NA         NA         NA         NA         NA
2 NA         NA         NA         NA         NA         NA         NA
3 NA         NA         NA         NA         NA         NA         NA
4 NA         NA         NA         NA         NA         NA         NA
5 NA         NA         NA         NA         NA         NA         NA
6 NA         NA         NA         NA         NA         NA         NA
  x75th.week x76th.week
1 NA         NA
2 NA         NA
3 NA         NA
4 NA         NA
5 NA         NA
6 NA         NA

## Error:
Multiple types in one table

In [33]:
billboard_tidy <- billboard %>%
                    pivot_longer(
                    cols = ends_with("week"),
                    names_to = "week",
                    values_to = "rank"
                    )
billboard_tidy <-billboard_tidy %>% 
                    dplyr::rename(artist = artist.inverted, "data entered" = date.entered , "data peaked" = date.peaked)
billboard_tidy %>%
    head()

  year artist          track                    time     genre data entered
1 2000 Destiny's Child Independent Women Part I 03:38:00 Rock  2000-09-23
2 2000 Destiny's Child Independent Women Part I 03:38:00 Rock  2000-09-23
3 2000 Destiny's Child Independent Women Part I 03:38:00 Rock  2000-09-23
4 2000 Destiny's Child Independent Women Part I 03:38:00 Rock  2000-09-23
5 2000 Destiny's Child Independent Women Part I 03:38:00 Rock  2000-09-23
6 2000 Destiny's Child Independent Women Part I 03:38:00 Rock  2000-09-23
  data peaked week      rank
1 2000-11-18  x1st.week 78
2 2000-11-18  x2nd.week 63
3 2000-11-18  x3rd.week 49
4 2000-11-18  x4th.week 33
5 2000-11-18  x5th.week 23
6 2000-11-18  x6th.week 15